## Terraform Plan - beta

#### Terraform Format and Style ``
#### Terraform Initialization ``
#### Terraform Validation ``
#### Terraform Plan -lock=false `success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mrandom_string.suffix: Refreshing state... [id=7bgawsey][0m
[0m[1mmodule.s3.aws_s3_bucket.images: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m
[0m[1mmodule.dynamodb.aws_dynamodb_table.prod_results: Refreshing state... [id=prod_results][0m
[0m[1mmodule.dynamodb.aws_dynamodb_table.beta_results: Refreshing state... [id=beta_results][0m
[0m[1mmodule.s3.aws_s3_bucket_public_access_block.images: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m
[0m[1mmodule.s3.aws_s3_bucket_versioning.images: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m
[0m[1mmodule.s3.aws_s3_bucket_server_side_encryption_configuration.images: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m
[0m[1mmodule.s3.aws_s3_bucket_lifecycle_configuration.images: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m
[0m[1mmodule.iam.aws_iam_user.github_actions: Refreshing state... [id=pixel-learning-github-actions-user][0m
[0m[1mmodule.iam.aws_iam_role.lambda_role: Refreshing state... [id=pixel-learning-rekognition-lambda-role][0m
[0m[1mmodule.iam.aws_iam_user_policy.github_actions_policy: Refreshing state... [id=pixel-learning-github-actions-user:pixel-learning-github-actions-policy][0m
[0m[1mmodule.iam.aws_iam_access_key.github_actions: Refreshing state... [id=AKIAY6QVY2XVCOGNZG54][0m
[0m[1mmodule.iam.aws_iam_role_policy.s3_policy: Refreshing state... [id=pixel-learning-rekognition-lambda-role:pixel-learning-lambda-s3-policy][0m
[0m[1mmodule.iam.aws_iam_role_policy.rekognition_policy: Refreshing state... [id=pixel-learning-rekognition-lambda-role:pixel-learning-lambda-rekognition-policy][0m
[0m[1mmodule.iam.aws_iam_role_policy.dynamodb_policy: Refreshing state... [id=pixel-learning-rekognition-lambda-role:pixel-learning-lambda-dynamodb-policy][0m
[0m[1mmodule.iam.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=pixel-learning-rekognition-lambda-role-20251020232807767500000001][0m
[0m[1mmodule.lambda.aws_cloudwatch_log_group.beta: Refreshing state... [id=/aws/lambda/rekognition-beta-handler][0m
[0m[1mmodule.lambda.aws_cloudwatch_log_group.prod: Refreshing state... [id=/aws/lambda/rekognition-prod-handler][0m
[0m[1mmodule.lambda.aws_lambda_function.prod: Refreshing state... [id=rekognition-prod-handler][0m
[0m[1mmodule.lambda.aws_lambda_function.beta: Refreshing state... [id=rekognition-beta-handler][0m
[0m[1mmodule.lambda.aws_lambda_function_url.beta: Refreshing state... [id=rekognition-beta-handler][0m
[0m[1maws_lambda_permission.allow_s3_beta: Refreshing state... [id=AllowS3InvokeBeta][0m
[0m[1maws_lambda_permission.allow_s3_prod: Refreshing state... [id=AllowS3InvokeProd][0m
[0m[1mmodule.lambda.aws_lambda_function_url.prod: Refreshing state... [id=rekognition-prod-handler][0m
[0m[1maws_s3_bucket_notification.bucket_notifications: Refreshing state... [id=pixel-learning-rekognition-images-7bgawsey][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.dynamodb.aws_dynamodb_table.beta_results[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_dynamodb_table" "beta_results" {
        id                          = "beta_results"
        name                        = "beta_results"
      [33m~[0m[0m tags                        = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            "Name"        = "pixel-learning-beta-results"
        }
      [33m~[0m[0m tags_all                    = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.dynamodb.aws_dynamodb_table.prod_results[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_dynamodb_table" "prod_results" {
        id                          = "prod_results"
        name                        = "prod_results"
      [33m~[0m[0m tags                        = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            "Name"        = "pixel-learning-prod-results"
        }
      [33m~[0m[0m tags_all                    = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

        [90m# (7 unchanged blocks hidden)[0m[0m
    }

[1m  # module.iam.aws_iam_role.lambda_role[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_role" "lambda_role" {
        id                    = "pixel-learning-rekognition-lambda-role"
        name                  = "pixel-learning-rekognition-lambda-role"
      [33m~[0m[0m tags                  = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            "Name"        = "pixel-learning-rekognition-lambda-role"
        }
      [33m~[0m[0m tags_all              = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.iam.aws_iam_user.github_actions[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_user" "github_actions" {
        id            = "pixel-learning-github-actions-user"
        name          = "pixel-learning-github-actions-user"
      [33m~[0m[0m tags          = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            "Name"        = "pixel-learning-github-actions-user"
        }
      [33m~[0m[0m tags_all      = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda.data.archive_file.lambda_zip[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "archive_file" "lambda_zip" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m output_base64sha256 = (known after apply)
      [32m+[0m[0m output_base64sha512 = (known after apply)
      [32m+[0m[0m output_md5          = (known after apply)
      [32m+[0m[0m output_path         = "modules/lambda/lambda_function.zip"
      [32m+[0m[0m output_sha          = (known after apply)
      [32m+[0m[0m output_sha256       = (known after apply)
      [32m+[0m[0m output_sha512       = (known after apply)
      [32m+[0m[0m output_size         = (known after apply)
      [32m+[0m[0m source_dir          = "./../lambda"
      [32m+[0m[0m type                = "zip"
    }

[1m  # module.lambda.aws_lambda_function.beta[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "beta" {
        id                             = "rekognition-beta-handler"
      [33m~[0m[0m last_modified                  = "2025-10-20T23:28:16.309+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "v4M/VlxBQC48R7Z/FEpQ4iaMdTzWhTxC/DfJIzE3vTk=" -> (known after apply)
        tags                           = {
            "Environment" = "beta"
            "Name"        = "pixel-learning-rekognition-beta-handler"
        }
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda.aws_lambda_function.prod[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "prod" {
        id                             = "rekognition-prod-handler"
      [33m~[0m[0m last_modified                  = "2025-10-20T23:28:22.047+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "v4M/VlxBQC48R7Z/FEpQ4iaMdTzWhTxC/DfJIzE3vTk=" -> (known after apply)
        tags                           = {
            "Environment" = "prod"
            "Name"        = "pixel-learning-rekognition-prod-handler"
        }
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.s3.aws_s3_bucket.images[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_s3_bucket" "images" {
        id                          = "pixel-learning-rekognition-images-7bgawsey"
      [33m~[0m[0m tags                        = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            "Name"        = "pixel-learning-rekognition-images"
        }
      [33m~[0m[0m tags_all                    = {
          [33m~[0m[0m "Environment" = "prod" [33m->[0m[0m "beta"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 7 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mInvalid Attribute Combination[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.s3.aws_s3_bucket_lifecycle_configuration.images,
[33m│[0m [0m  on modules/s3/main.tf line 42, in resource "aws_s3_bucket_lifecycle_configuration" "images":
[33m│[0m [0m  42: resource "aws_s3_bucket_lifecycle_configuration" "images" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mNo attribute specified when one (and only one) of
[33m│[0m [0m[rule[0].filter,rule[0].prefix] is required
[33m│[0m [0m
[33m│[0m [0mThis will be an error in a future version of the provider
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @shehuj, Action: `pull_request`, Environment: `beta`*
